export const bitcoinHistory=`Марк Андрессен, разработчик первого графического интернет-браузера NCSA Mosaic, считает, что на фундаментальном уровне система «Биткойн» является прорывом в области компьютерных наук, который опирается на 20 лет исследований криптографических валют и 40 лет работы в области криптографии тысяч исследователей по всему миру.

В 1983 году Дэвид Чаум (англ. David Chaum) и Стефан Брэндс (англ. Stefan Brands) предложили первые протоколы «электронной наличности»[34].

В мае 1997 года Адам Бэк для противодействия отправке спама и DoS-атакам предложил Hashcash, основанную на системе доказательства выполнения работы. Впоследствии подобная система в другой реализации стала частью процедуры создания новых блоков в биткойн-базе.

Идеи криптовалюты «b-money» описал в 1998 году Вэй Дай[en] в рассылке шифропанков. Независимо от него примерно в то же время аналогичные идеи предложил Ник Сабо для «bit-gold». Ник Сабо также предложил модель рыночного механизма, основанного на управлении инфляцией, и исследовал некоторые аспекты выявления надёжной информации в ненадёжной децентрализованной системе (задача византийских генералов).

Позднее Хэл Финни реализовал связку цепочек хеш-блоков для системы Hashcash на базе чипа для шифрования IBM в рамках спецификации TPM. Хэл Финни стал вторым участником сети Биткойн.

В 2008 году человеком или группой людей под псевдонимом Сатоси Накамото (англ. Satoshi Nakamoto) был опубликован файл с описанием протокола и принципа работы платёжной системы в виде одноранговой сети. По словам Сатоси, разработка началась в 2007 году. В 2009 году он закончил разработку протокола и опубликовал код программы-клиента.

3 января 2009 года был сгенерирован первый блок и первые 50 биткойнов. Первая транзакция по переводу биткойнов произошла 12 января 2009 года — Сатоси Накамото отправил Хэлу Финни 10 биткойнов. Первый обмен биткойнов на национальные деньги произошёл в сентябре 2009 года — Марти Малми (Martti Malmi) отправил пользователю с псевдонимом NewLibertyStandard 5050 биткойнов, за которые получил на свой счёт в PayPal 5,02 доллара. NewLibertyStandart предложил использовать для оценки биткойнов стоимость электроэнергии, затрачиваемой на генерацию.

Первый обмен биткойнов на реальный товар произошёл в мае 2010 года — американец Ласло Ханеч за 10 000 биткойнов получил две пиццы с доставкой.

Дальнейшую разработку организует и координирует сообщество разработчиков, при этом любые значительные изменения в протоколе должны быть приняты большинством владельцев майнинговых пулов.

1 августа 2017 года группа разработчиков и майнеров запустила форк «Биткойна» под названием «Bitcoin Cash». Новая криптовалюта имеет общую историю с «Биткойном»: обратную совместимость по структуре блока до 1 августа, но имеет несовместимую структуру после 1 августа.`;
